"&About Flash Decompiler..." = "&Về Flash Decompile..."
"&Copy" = "&Sao chép"
"&Help" = "Trợ &giúp"
"&Keyboard shortcuts" = "&Lối tắt bàn phím"
"&Localization" = "&Ngôn ngữ"
"&Open file and add it to tasks..." = "&Mở tập tin và thêm nó vào công việc..."
"&Preview file in player..." = "&Xem trước tập tin trong trình chơi..."
"&Save SWF/EXE as..." = "&Lưu SWF/EXE như..."
"&Tutorials" = "&Hướng dẫn"
"16 (high color)" = "16 (màu cao)"
"24 (true color)" = "24 (màu đúng)"
"32 (true color)" = "32 (màu đúng)"
"8 (colormapped)" = "8 (màu ánh xạ)"
"AUTO" = "TỰ ĐỘNG"
"ActionScript" = "ActionScript"
"ActionScript (*.as)" = "ActionScript (*.as)"
"ActionScript options" = "Tùy chọn ActionScript"
"ActionScript search" = "Tìm kiếm ActionScript"
"ActionScripts viewing mode settings. This only effects ActionScripts, shown in Flash Decompiler." = "Thiết đặt chế độ xem các ActionScript. Đây chỉ là các hiệu ứng ActionScript, được hiện thị trong Flash Decompiler"
"Actions" = "Hành động"
"Activity log" = "Bản ghi hành động"
"Add SWF files to tasks" = "Thêm các tập tin SWF vào công việc"
"Add all files in the current directory to My tasks list\r\nrecursively, including subfolders." = "Thêm tất cả tập tin trong thư mục hiện thời vào Danh sách công việc của tôi\r\nmột cách trình tự, kể cả thư mục con"
"Add currently selected SWF/EXE file\r\ninto My tasks list for management,\r\nconversion and extraction." = "Thêm tập tin SWF/EXE đã chọn hiện thời vào \r\nDanh sách công việc của tôi để quản lí,\r\nchuyển đổi và trích xuất"
"Add folder" = "Thêm thư mục"
"Add folder recursively" = "Thêm thư mục tuần tự"
"Add folder root" = "Thêm thư mục gốc"
"Add only files present in folder's root to My tasks list." = "Chỉ thêm các tập tin co mặt trong thư mục gốc vao Danh sách công việc của tôi"
"Add task" = "Thêm công việc"
"Add whole folder into My tasks list." = "Thêm toàn bộ thư mục trong danh sách công việc của tôi"
"Advanced morph decompilation" = "Hình thức biên soạn ngược nâng cao"
"Align" = "Canh hàng"
"Align text to the left" = "Canh văn bản sang trái"
"Align text to the right" = "Canh văn bản sang phải"
"All supported files (*.SWF; *.EXE)|*.SWF;*.EXE|SWF Files (*.SWF)|*.SWF|Projectors (*.EXE)|*.EXE|" = "Tất cả tập tin hỗ trợ (*.SWF; *.EXE)|*.SWF;*.EXE|Tập tin SWF (*.SWF)|*.SWF|Dự án (*.EXE)|*.EXE|"
"All supported image formats (*.JPG, *.JPEG, *.JPE, *.BMP, *.PNG)|*.JPG;*.JPEG;*.JPE;*.BMP;*.PNG|JPEG compressed images (*.JPG, *.JPEG, *.JPE)|*.JPG;*.JPEG;*.JPE|Bitmaps (*.BMP)|*.BMP|Portable network graphics (*.PNG)|*.PNG|" = "Tất cả định dạng ảnh hỗ trợ (*.JPG, *.JPEG, *.JPE, *.BMP, *.PNG)|*.JPG;*.JPEG;*.JPE;*.BMP;*.PNG|Ảnh nén JPEG (*.JPG, *.JPEG, *.JPE)|*.JPG;*.JPEG;*.JPE|ẢNh Bitmap (*.BMP)|*.BMP|Portable network graphics (*.PNG)|*.PNG|"
"All words" = "Tất cả từ"
"Allows/Disables text selection" = "Cho phép/Vô hiệu chọn văn bản"
"Almost the same with previewing a file,\r\nbut will also add it to My tasks list for further processing." = "Gần giống như vậy với việc xem trước một tập tin, \r\nnhưng cũng sẽ thêm nó vào Danh sách công việc của tôi cho các tiến trình sau này"
"Any word" = "Vài từ"
"As FLA" = "Như FLA"
"Autodetect" = "Tự động nhận"
"Autosize" = "Tự động điều chỉnh"
"Available localizations" = "Ngôn ngữ hiện có"
"Background color:" = "Màu nền"
"Beta-tester" = "Người kiểm tra bản Beta"
"Bitmap Files (*.bmp)|*.bmp|" = "Tập tin Bitmap (*.bmp)|*.bmp|"
"Bits per ADPCM sample:" = "Mẫu Bit/ADPCM:"
"Bits per pixel" = "Bit/điểm ảnh"
"Bits per pixel:" = "Bit/điểm ảnh"
"Bits per sample:" = "Bit/mẫu"
"Bounds" = "Giới hạn"
"Braces around single statement" = "Dấu ngoặc quanh câu lệnh"
"Braces at new line" = "Dấu ngoặc ở dòng mới"
"Build %@" = "Xây dựng %@"
"Business" = "Kinh doanh"
"Button" = "Nút"
"Buttons" = "Nút"
"By default Flash Decompiler will show actual snapshots of most of the Flash objects for preview, when you select the whole category/group. Making previews of multiple objects may substantially slow down Flash Decompiler performance when you navigate through objects groups, especially when there are more than 100 items there. So, you might wish to disable thumbnails generation for certain object types. Tiny nice icons will be shown to you then." = "Mặc định Flash Decompiler sẽ hiển thị các ảnh chụp hiện thời của phần lớn các đối tượng Flash để xem trước, khi bạn chọn toàn bộ danh mục/nhóm. Tạo các xem trước của nhiều đối tượng có thể căn bản làm giảm hiệu suất của Flash Decompiler khi bạn đánh dấu hết các nhóm đối tượng, đặc biệt khi có hơn 100 mục ở đây. Vì thế, bạn có thể muốn vô hiệu việc tạo các ảnh thu nhỏ cho các loại đối tượng nào đó. Các biểu tượng nhỏ xinh sẽ được hiển thị cho bạn sau đó."
"Cancel" = "Hủy bỏ"
"Center text" = "Văn bản ở giữa"
"Change ActionScripts view to Pi-code actions representation" = "Thay đổi cách xem ActionScripts sang trình bày các hành động Pi-code"
"Change ActionScripts view to common representation" = "Thay đổi cách xem ActionScripts sang trình bày chung"
"Change ActionScripts view to hex dump representation" = "Thay đổi cách xem ActionScripts trình bày kết xuất 16"
"Change ActionScripts view to split mode including Pi-codes and hex dumps" = "Thay đổi cách xem ActionScripts sang chế độ chẻ bao gồm Pi-code và kết xuất 16"
"Change background color" = "Thay đổi màu nền"
"Change text type to passwords with masking" = "Thay đổi kiểu văn bản sang mật khẩu với mặt nạ"
"Change the text color" = "Thay đổi màu văn bản"
"Check for &newer version" = "&Kiểm tra phiên bản mới hơn "
"Check for availability of updated version online." = "Kiểm tra phiên bản cập nhật trực tuyến sẵn có"
"Check your Flash Decompiler copy details, like version, build,\r\nrelease date, technical support contacts, etc." = "Kiểm tra chi tiết bản sao Flash Decompiler của bạn, giống như, \r\nxây dựng, ngày phát hành, liên hệ hỗ trợ kĩ thuật, v.v..."
"Check/Uncheck selected items" = "Chọn/Bỏ chọn các mục đã chọn"
"Choose background color for current task" = "Chọn màu nền cho công việc hiện thời"
"Choose the language Flash Decompiler GUI will be displayed in." = "Chọn ngôn ngữ giao diện Flash Decompiler (GUI) sẽ được hiển thị"
"Clear My tasks" = "Xóa Công việc của tôi"
"Click here to check for newer version" = "Kích vào đây đẻ kiểm tra phiên bản mới hơn"
"Close" = "Đóng"
"Code format" = "Định dạng mã"
"Collapse current file" = "Che lấp tập tin hiện thời"
"Collapse current group" = "Che lấp nhóm hiện thời"
"Collapse everything" = "Che lấp mọi thứ"
"Color" = "Màu sắc"
"Colors" = "Màu sắc"
"Combine all scripts into folder" = "Phối hợp tất cả script vào trong thư mục"
"Compressed video (*.mpg)" = "Video nén (*.mpg)"
"Configure morph detection and decompilation\r\noptions for resulting FLA file." = "Cấu hình biên dịch ngược và nhận dạng morph\r\ncác tùy chọn cho kết quả tập tin FLA"
"Contact &Tech Support" = "&Liên hệ hỗ trợ kĩ thuật"
"Conversion options" = "Tùy chọn chuyển đổi"
"Conversion path:" = "Đường dẫn chuyển đổi:"
"Convert" = "Chuyển đổi"
"Convert SWF file(s) to FLA" = "Chuyển đổi tập tin SWF sang FLA"
"Convert all" = "Chuyển đổi tất cả"
"Convert all available tasks to FLA." = "Chuyển đổi tất cả công việc sẵn có sang FLA"
"Convert current" = "Chuyển đổi hiện thời"
"Convert currently highlighted file from the tasks list." = "Chuyển đổi các tập tin được đánh dấu hiện thời từ danh sách công việc"
"Convert static text into shapes" = "Chuyển đổi văn bản tĩnh sang các hình dạng"
"Copy to clipboard" = "Sao chép vào bộ nhớ tạm"
"Count" = "Đếm"
"Create folder for morphs" = "Tạo thư mục cho các morph"
"Current" = "Hiện thời"
"Custom color" = "Tùy chỉnh màu"
"Customize some advanced options of Flash Decompiler" = "Tùy chỉnh một số tùy chọn nâng cao của Flash Decompiler"
"Decode built-in MX classes" = "Giải mã các lớp xây dựng trong MX"
"Decode all classes as dynamic" = "Giải mã tất cả các lớp như động"
"Decompile symbols not present at timeline" = "Các biểu tượng không có trong dòng chờ"
"Decompiling task" = "Công việc biên dịch ngược"
"Default" = "Mặc định"
"Default settings" = "Các thiết đặt mặc định"
"Demo" = "Demo"
"Details" = "Chi tiết"
"Detect motion tweens" = "Nhận dạng giữa các chuyển động"
"Discard all changes which you applied\r\nand revert to last saved file." = "Hủy bỏ mọi thay đổi mà bạn đã áp dụng\r\nvà hoàn nguyên vào tập tin đã lưu sau cùng"
"Discard changes" = "Hủy bỏ các thay đổi"
"Do not show this message again" = "Không hiện thông báo này nữa"
"Do you really want to discard all the changes you made and revert to the last saved state of the SWF file?" = "Bạn thực sự muốn hủy bỏ tất cả các thay đổi bạn đã làm và hoàn nguyên lại trạng thái của tập tin SWF đã lưu sau cùng?"
"Do you really want to exit Flash Decompiler?" = "Bạn thực sự muốn thoát Flash Decompiler ?"
"Do you really want to remove all Flash files from My tasks?" = "Bạn thực sự muốn loại bỏ tất cả tập tin Flash từ Công việc của tôi?"
"Do you really want to remove selected file?" = "Bạn thực sự muốn loại bỏ tập tin đã chọn ?"
"Do you really want to save changes in <%@>?" = "Bạn thực sự muốn lưu các thay đổi trong <%@>?"
"Drag to zoom in and out" = "Kéo để phóng to và thu nhỏ"
"Dragging" = "Kéo"
"Dynamic text" = "Văn bản động"
"Dynamic texts" = "Văn bản động"
"Edit" = "Sửa"
"Edit Flash objects" = "Sửa đối tượng Flash"
"Edit Images" = "Sửa ảnh"
"Edit URL's" = "Sửa URL"
"Edit URLs" = "Sửa URL"
"Edit color" = "Sửa màu sắc"
"Edit colors" = "Sửa màu sắc"
"Edit colors in SWF/EXE tasks. Opens a special panel\r\nwhere you can edit most of the colors you see\r\nin a movie. Cannot edit raster images, etc." = "Sửa màu sắc các công việc SWF/EXE. Mở một bản đặc biệt\r\nmà bạn có thể sửa phần lớn màu sắc mà bạn thấy\r\ntrong một phim. Không thể sửa các ảnh đường mành, v.v..."
"Edit dynamic texts" = "Sửa văn bản động"
"Edit images" = "Sửa ảnh"
"Edit lines" = "Sửa dòng"
"Edit lines in a SWF/EXE task: edit line thickness, and color.\r\nDon't forget to select the desired shape if no lines are shown." = "Sửa các dòng trong một công việc SWF/EXE: sửa độ dày đường, và màu sắc.\r\nĐừng quên chọn hình dạng mong muốn nếu không có đường được hiển thị"
"Edit lines:" = "Sửa dòng:"
"Edit links" = "Sửa liên kết"
"Edit links found in a SWF/EXE task.\r\nNote, that you will be editing all links in a task." = "Sửa các liên kết tìm thấy trong một công việc SWF/EXE.\r\nChú ý rằng bạn sẽ đang sửa tất cả liên kết trong một công việc"
"Edit links: " = "Sửa liên kết: "
"Edit shapes" = "Sửa hình dạng"
"Edit sounds" = "Sửa âm thanh"
"Enable automatic size setting" = "Cho phép tự động thiết đặt kích thước"
"Enable multi-line text positioning" = "Cho phép vị trí văn bản đa dòng"
"Enable word-wrapping" = "Cho phép xuongs dòng tự động từ"
"Enter &registration code" = "&Nhập mã đăng kí"
"Exact match" = "So khớp chính xác"
"Exit" = "Thoát"
"Exit Flash Decompiler. All unsaved editing tasks will promt for saving." = "Thoát Flash Decompiler. Tất cả các công việc đang sửa chưa lưu sẽ được nhắc nhở lưu"
"Expand current file" = "Mở rộng tập tin hiện thời"
"Expand group" = "Mở rộng nhóm"
"Export format" = "Định dạng xuất ra"
"Export path:" = "Đường dẫn xuất ra:"
"Extract" = "Giải nén"
"Extract SWF objects" = "Giải nén các đối tượng SWF"
"Extract all currently selected SWF resources.\r\nThe Export path can be changed in the main Extract tab." = "Giải nén tất cả nguồn SWF được chọn hiện thời\r\nĐường dẫn xuất ra có thể được thay đổi trong thẻ Giải nén chính"
"Extract all currently selected SWF resources.\r\nThe path you see to the left will be used to store the objects in." = "Giải nén tất cả nguồn SWF được chọn hiện thời.\r\nĐường dẫn mà bạn thấy ở bên trái sẽ được dùng để chứa các đối tượng trong đó"
"Extract now" = "Giải nén bây giờ"
"Extract resource" = "Giải nén nguồn"
"Extracting SWF objects" = "Giải nén các đối tượng SWF"
"FLA" = "FLA"
"FLA version" = "Phiên bản FLA"
"Failed to open image <%@>" = "Lỗi mở ảnh <%@>"
"Failed to open sound file <%@>" = "Lỗi mở tập tin âm thanh<%@>"
"File" = "Tập tin"
"File explorer" = "Truy xuất tập tin"
"File properties" = "Thuộc tính tập tin"
"Find the ways to reach Eltima technical support for answers and tips." = "Tìm cách đến hỗ trợ kĩ thuật Eltima để tìm các câu trả lời và thủ thuật"
"Fit all" = "Làm vừa tất cả"
"Fit to Player area" = "Làm vừa vùng Trình chơi"
"Flash Decompiler &homepage" = "Trang chủ &Flash Decompiler"
"Flash Decompiler Options" = "Tùy chọn Flash Decompiler"
"Flash Decompiler Trillix" = "Flash Decompiler Trillix"
"Flash Decompiler Trillix Options" = "Tùy chọn Flash Decompiler Trillix"
"Flash Movie (*.swf)" = "Phim Flash (*.swf)"
"Flash Player 5" = "Flash Player 5"
"Flash Player 6" = "Flash Player 6"
"Flash Player 7" = "Flash Player 7"
"Flash Player 8" = "Flash Player 8"
"Flash Player ActiveX version installed in your system" = "Phiên bản Flash Player ActiveX được cài trong hệ thống của bạn"
"Flash Source (*.fla)" = "Nguồn Flash (*.fla)"
"Flash Video (*.flv)" = "Flash Video (*.flv)"
"Flash objects thumbnails settings when groups are selected" = "Thiết đặt thu nhỏ các đối tượng Flash khi nhóm được chọn"
"Font" = "Font"
"Font size" = "Cỡ Font"
"Fonts" = "Font"
"Force ANSI encoding" = "Ép buộc mã hóa ANSI"
"Formats" = "Định dạng"
"Frame" = "Khung"
"Frame count:" = "Đếm khung:"
"Framerate:" = "Tần số khung:"
"Frames" = "Khung"
"General" = "Chung"
"Globally search ActionScripts within SWF/EXE files." = "Tìm kiếm toàn bộ các ActionScript nằm trong tập tin SWF/EXE"
"Has alpha" = "Có al-pha"
"Has border" = "Có đường viền"
"Has wordwrap" = "Có tự động xuống dòng"
"Height:" = "Chiều cao:"
"Hex dump" = "Kết xuất 16"
"Hex dump (*.txt)" = "Kết xuất 16 (*.txt)"
"Hexadicimal dump" = "Kết xuất Hexadicimal"
"Homepage" = "Trang chủ"
"Hypertext (*.html)" = "Siêu văn bản (*.html)"
"Icons" = "Biểu tượng"
"Id" = "Id"
"If you experience unusual behavior of your Flash movies in Flash Decompiler,\nthe problem may be caused by the older version of Flash Player ActiveX\nwhich is currently installed in your system. You may check for availability\nof the new version by clicking the following button, or visiting www.adobe.com" = "Neu ban cam thay các hành vi khác thuong cua các phim FLash cua ban trong FLash Decompiler,van đe có the do phiên bản cũ cua Flash Player ActiveX\nđang đuoc cài hien thoi trên máy ban. Ban có the kiem tra phiên ban moi hơn bang cách kích nút sau, hoac ghé thăm www.adobe.com"
"Ignore case" = "Lờ đi chữ"
"Image" = "Ảnh"
"Image (*.png, *.jpeg, *.bmp)" = "Ảnh (*.png, *.jpeg, *.bmp)"
"Image format" = "Định dạng ảnh"
"Image properties" = "Thuộc tính ảnh"
"Images" = "Ảnh"
"Indent" = "Thụt lề"
"Indent size" = "Kích thước thụt"
"Info" = "Thông tin"
"Is HTML" = "HTML"
"Is multiline" = "Nhiều dòng"
"Is password" = "Mật khẩu"
"Is read-only" = "Chỉ đọc"
"Join mask layers" = "Nối các lớp mặt nạ"
"Justify text: align text to both left and right,\r\nby adding extra spaces between words." = "Canh đều văn bản: canh văn bản cả bên trái và bên phải,\r\nbằng cách thêm khoảng trắng giữa các từ."
"Layer" = "Lớp"
"Leading" = "Dãn cách dòng"
"Leave current" = "Cho phép hiện thời"
"Left margin" = "Lề trái"
"Length factor: " = "Thừa số độ dài : "
"Library folders" = "Thư mục thư viện"
"License:" = "Giấy phép:"
"Line properties" = "Thuộc tính dòng"
"Line thickness in twips" = "Độ dày dòng trong các twip)"
"Lines" = "Dòng"
"Link location to edit: " = "Vị trí liên kết để sửa: "
"Link target: " = "Liên kết đích: "
"Links" = "Liên kết"
"List" = "Danh sách"
"Logics: " = "Logic: "
"Lossless" = "Không bị mất"
"MP3 bitrate:" = "Tâng số MP3:"
"MPG" = "MPG"
"Macromedia Flash 8 (v8)" = "Macromedia Flash 8 (v8)"
"Macromedia Flash Components (*.swc)|*.swc||" = "Thành phần Macromedia Flash (*.swc)|*.swc||"
"Macromedia Flash MX (v6)" = "Macromedia Flash MX (v6)"
"Macromedia Flash MX 2004 (v7)" = "Macromedia Flash MX 2004 (v7)"
"Make this dynamic text read-only" = "Tạo văn bản động này chỉ đọc"
"Manage" = "Quản lí"
"Measured in twips: %@" = "Đo lường trong các twip: %@"
"More Colors" = "Thêm màu"
"More colors ... " = "Thêm màu ... "
"Morph" = "Morph"
"Morph Options" = "Tùy chọn Morph"
"Morphs" = "Morph"
"Motion tweens" = "Ở giữa các chuyển động"
"Movement smoothness: " = "Độ mượt chuyển động "
"My tasks (SWF, EXE)" = "Công việc của tôi (SWF, EXE)"
"New" = "Mới"
"No" = "Không"
"No Flash file selected" = "Không có tập tin Flash được chọn"
"No available tasks.\r\nPlease, add SWF or Projector EXE\r\nfiles here to activate other tabs." = "Không có sẵn công việc\r\nHãy thêm các tập tin SWF hoặc tập Dự án EXE\r\nở đây đểkích hoạt các thẻ khác"
"No images to edit in this task.\r\nThis Flash movie does not contain any.\r\n" = "Không có ảnh được sửa trong công việc này\r\nPhim Flash này không chứa ảnh\r\n"
"No links available in this task for editing.\r\nThere may be no links,\r\nor they are dynamically built or else.\r\n" = "Không có liên kết trong công việc này để sửa\r\nCó thể không có liên kết\r\nhoặc chúng được tạo động hoặc lí do khác\r\n"
"No sounds to edit in this task.\r\n" = "Không có âm thanh để sửa trong công việc này\r\n"
"No tag information available for currently selected item, or no item selected. Please, choose some part of the movie in the tasks list." = "Không có thẻ thông tin cho mục được chọn hiện thời. Vui lòng chọn một số phần của phim trong danh sách công việc"
"Non-compressed video (*.avi)" = "Video không nén (*.avi)"
"Nothing found to match your query." = "Không gì tìm thấy theo yêu cầu của bạn"
"Object" = "Đối tượng"
"Objects" = "Đối tượng"
"Ok" = "Đồng ý"
"Open User &Manual" = "&Mở Hướng Dẫn Sử Dụng"
"Open destination folder after extraction" = "Mở thư mục đích sau khi giải nén"
"Open file after conversion" = "Mở tập tin sau khi chuyển đổi"
"Open local CHM user manual for help." = "Mở vị trí hướng dẫn người dung CHM để trợ giúp"
"Opens SWF or Projector file in main player for preview.\r\nFile is not added to My tasks list." = "Mở tập tin SWF hoặc Dự án trong trình chơi chính để xem trước\r\nTập tin không được thêm vào Danh sách công việc của tôi"
"Order full version" = "Mua phiên bản đầy đủ"
"Other" = "Khác"
"Other colors" = "Màu khác"
"P-Code" = "P-Code"
"P-Code and hexadicimal dump combined" = "P-Code và kết xuất 16 được kết hợp"
"Personal" = "Cá nhân"
"Pi-code and hex dump (*.txt)" = "Pi-code và kết xuất 16 (*.txt)"
"Pi-code dump (*.txt)" = "Kết xuất Pi-code (*.txt)"
"Place morphs into library" = "Đặt các morph vào trong thư viện"
"Place shapes into library" = "Đặt các hình vào trong thư viện"
"Place texts into library" = "Đặt các văn bản vào trong thư viện"
"Placement information" = "Thông tin đặt"
"Placeobjects" = "Đối tượng đặt"
"Plain Text (*.txt)" = "Thuần văn bản (*.txt)"
"Player parameters" = "Thông số trình chơi"
"Please, choose the desired format for ActionScripts present\r\nin the tasks to be exported into.\r\nAvailable formats: Pi-code, hex dump or plain text file." = "Hãy chọn định dạng mong muốn cho các ActionScript hiện có\r\ntrong các công việc để được xuất vào trong\r\nCác định dạng sẵn có: Pi-code, kết xuất 16 hoặc tập tin thuần văn bản."
"Please, choose the desired format for buttons present\r\nin the tasks to be exported into.\r\nAvailable formats: SWF and FLA." = "Hãy chọn định dạng mong muốn cho các nút hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: SWF và FLA."
"Please, choose the desired format for fonts present\r\nin the tasks to be exported into.\r\nAvailable formats: SWF and FLA." = "Hãy chọn định dạng mong muốn cho các font hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: SWF và FLA."
"Please, choose the desired format for frames present\r\nin the tasks to be exported into.\r\nAvailable formats: SWF and FLA." = "Hãy chọn định dạng mong muốn cho các khung hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: SWF và FLA."
"Please, choose the desired format for images present\r\nin the tasks to be exported into.\r\nAvailable formats: JPG, PNG, BMP, SWF or FLA" = "Hãy chọn định dạng mong muốn cho các ảnh hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: JPG, PNG, BMP, SWF hoặc FLA"
"Please, choose the desired format for morphs present\r\nin the tasks to be exported into.\r\nAvailable formats: SWF and FLA." = "Hãy chọn định dạng mong muốn cho các morph hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: SWF and FLA."
"Please, choose the desired format for shapes present\r\nin the tasks to be exported into.\r\nAvailable formats: SWF and FLA." = "Hãy chọn định dạng mong muốn cho các hình hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: SWF and FLA."
"Please, choose the desired format for sounds present\r\nin the tasks to be exported into.\r\nAvailable formats: WAV, MP3, SWF or FLA." = "Hãy chọn định dạng mong muốn cho các âm thanh hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: WAV, MP3, SWF or FLA."
"Please, choose the desired format for sprites present\r\nin the tasks to be exported into.\r\nAvailable formats: SWF and FLA." = "Hãy chọn định dạng mong muốn cho các sprite hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: SWF và FLA."
"Please, choose the desired format for texts present\r\nin the tasks to be exported into.\r\nAvailable formats: TXT, RTF, HTML, SWF or FLA." = "Hãy chọn định dạng mong muốn cho các văn bản hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: TXT, RTF, HTML, SWF hoặc FLA."
"Please, choose the desired format for videos present\r\nin the tasks to be exported into.\r\nAvailable formats: FLV, AVI, MPG, SWF or FLA." = "Hãy chọn định dạng mong muốn cho các video hiện có\r\ntrong các công việc để được xuất vào trong.\r\nCác định dạng sẵn có: FLV, AVI, MPG, SWF hoặc FLA."
"Please, note that Flash Decompiler will process the tasks which are currently added in My tasks panel, and not necessarily the one which is currently previewed. Make sure the files you need converted or exported from are in My tasks list." = "Xin lưu ý rằng Flash Decompiler sẽ xử lí các công việc được thêm hiện thời trong bảng Công việc của tôi, và không nhất thiết công việc được xem trước hiện thời\r\nHãy chắc chắn các tập tin bạn cần chuyển đổi hoặc xuất nằm trong Danh sách công việc của tôi"
"Please, select target folder where resulting extracted objects should be saved to." = "Hãy chọn thư mục đích để lưu kết quả các đối tượng được xuất"
"Preparing preview..." = "Chuẩn bị xem trước..."
"Preview not available" = "Xem trước không sẵn có"
"Property" = "Đặc tính"
"Quality" = "Chất lượng"
"Ready" = "Sẵn sàng"
"Recover original variables names" = "Phục hồi các tên biến gốc"
"Refresh" = "Làm tươi"
"Register your copy of Flash Decompiler\r\nby entering your registration name and code." = "Đăng kí bản sao của Flash Decompiler bằng cách nhập tên và mã đăng kí của bạn"
"Registered to:" = "Được đăng kí cho"
"Registration code:" = "Mã đăng kí"
"Reload current directory" = "Nạp lại thư mục hiện thời"
"Up one level" = "Lên một cấp"
"Size" = "Kích thước"
"Type" = "Loại"
"Reload current task into original state" = "Nạp lại công việc hiện thời vào tình trạng gốc"
"Remove all" = "Loại bỏ tất cả"
"Remove all tasks from the tasks list." = "Loại bỏ tất cả công việc từ danh sách công việc"
"Remove current task" = "Loại bỏ công việc hiện thời"
"Remove current task from the tasks list." = "Loại bỏ công việc hiện thời từ danh sách"
"Remove file" = "Loại bỏ tập tin"
"Remove tasks" = "Loại bỏ công việc"
"Replace and edit dynamic texts currently present in a SWF/EXE task." = "Thay thế và sửa các văn bản động có mặt hiện thời trong một công việc SWF/EXE."
"Replace and edit texts currently present in a SWF/EXE task." = "Thay thế và sửa các văn bản có mặt hiện thời trong một công việc SWF/EXE."
"Replace original images in a SWF/EXE task: you can add\r\nJPEG and PNG images, edit their quality,\r\ntransparency settings and size." = "Thay thế các ảnh gốc trong một công việc SWF/EXE: bạn có thể thêm các ảnh JPEG và PNG\r\nsửa đổi chất lượng, thiết đặt độ trong suốt và kích thước của chúng"
"Replace original sounds in a SWF/EXE task:\r\nadd your own sounds instead of the original\r\nobjects, alter sound format and quality." = "Thay thế các âm thanh gốc trong một công việc SWF/EXE: thêm âm thanh của bạn thay vì các đối tượng gốc\r\nthay đổi định dạng và chất lượng âm thanh"
"Reset all extraction formats to default values." = "Đặt lại tất cả các định dạng giải nén theo giá trị mặc định"
"Reset all formats to FLA" = "Đặt lại tất cả các định dạng sang FLA"
"Reset all formats to SWF" = "Đặt lại tất cả các định dạng sang SWF"
"Reset this tab to default conversion settings." = "Đặt lại thẻ này theo các thiết đặt chuyển đổi mặc định"
"Reset to default conversion settings." = "Đặt lại theo các thiết đặt chuyển đổi mặc định"
"Reset to defaults" = "Đặt lại mặc định"
"Rich Text (*.rtf)" = "Rich Text (*.rtf)"
"Right" = "Bên phải"
"Right margin" = "Lề phải"
"SWF" = "SWF"
"SWF File Info" = "Thông tin tập tin SWF"
"SWF Resources Info" = "Thông tin nguồn SWF"
"SWF version" = "Phiên bản SWF"
"SWF version:" = "Phiên bản SWF:"
"Same as FLA version" = "Giống phiên bản FLA"
"Save" = "Lưu"
"Save Log" = "Lưu bản ghi"
"Save a SWF copy of the file currently selected in My tasks.\r\nNote, if you highlight a certain resource in a task, but another file\r\nfrom is currently displayed,the file highlighted in My tasks will be saved." = "lưu một bản sao SWF của tập tin được chọn hiện thời trong Công việc của tôi\r\nChú ý, nếu bạn đánh dấu một nguồn chắc chắn trong một công việc, nhưng một tập tin khác\r\nđược hiển thị hiện thời, tập tin được đánh dấu sẽ được lưu"
"Save as..." = "Lưu như..."
"Save current task in a new file with applied changes." = "Lưu công việc hiện thời trong một tập tin mới với các thay đổi được áp dụng"
"Save current task with applied changes." = "Lưu công việc hiện thời với các thay đổi được áp dụng"
"Save on disk" = "Lưu vào Ổ cứng"
"Save/Discard changes" = "Lưu/Hủy bỏ các thay đổi"
"Screenshot" = "Ảnh chụp màn hình"
"Scripts" = "Script"
"Search" = "Tìm kiếm"
"Search for: " = "Tìm kiếm "
"Search now" = "Tìm ngay"
"Search only in current SWF" = "Chỉ tìm trong SWF hiện thời"
"Search options" = "Tùy chọn tìm"
"Search results" = "Kết quả tìm"
"Select folder to add to the tasks list" = "Chọn thư mục để thêm vào danh sách công việc"
"Select folder to convert object to" = "Chọn thư mục để chuyển đổi đối tượng vào"
"Select the version of FLA format to be created" = "Chọn phiên bản của định dạng FLA để tạo"
"Select the version of SWF format which would be set\r\nby default when you'll be publishing the converted FLA." = "Chọn phiên bản của định dạng SWF mà bạn sẽ đặt\r\nlàm mặc định khi bạn xuất bản FLA đã chuyển đổi."
"Selectable" = "Có thể chọn"
"Separate layers for morphs" = "Tách các lớp cho morph"
"Set all extraction formats except for ActionScript to FLA" = "Đặt tất cả định dạng giải nén ngoại trừ  ActionScript cho FLA"
"Set all extraction formats except for ActionScript to SWF" = "Đặt tất cả định dạng giải nén ngoại trừ  ActionScript cho SWF"
"Shape" = "Hình dạng"
"Shapes" = "Hình dạng"
"Size (bytes)" = "Kích thước (byte)"
"Size in bytes" = "Kích thước theo Byte"
"Small icons" = "Biểu tượng nhỏ"
"Some tutorials on Flash Decompiler usage" = "Một số hướng dẫn sử dụng Flash Decompiler"
"Sound" = "Âm thanh"
"Sound (*.wav, *.mp3)" = "Âm thanh (*.wav, *.mp3)"
"Sound rate" = "Tần số âm thanh"
"Sounds" = "Âm thanh"
"Sprite" = "Sprite"
"Sprites" = "Sprite"
"Standard colors" = "Màu chuẩn"
"Static text" = "Văn bản tĩnh"
"Static text bounding box expansion" = "Văn bản tĩnh quanh phần mở rộng hộp"
"Status" = "Trạng thái"
"Stereo (mono if unchecked)" = "Kênh đôi (kênh đơn nếu bỏ chọn)"
"Stretch/Shrink new image to fit original size" = "Căng ra/Co lại ảnh mới để vừa với kích thước gốc"
"Support e-mail: support@eltima.com" = "Email hỗ trợ: support@eltima.com"
"Switch to dragging mode (movie interactive objects will not be active)" = "Chuyển sang chế độ kéo (các đối tượng tác động lẫn nhau sẽ không được kích hoạt)"
"Switch to original size" = "Chuyển sang kích thước gốc"
"Tag" = "Thẻ"
"Tag information" = "Thông tin thẻ"
"Take snapshot" = "Lấy ảnh chụp"
"Taken snapshot will be copied to clipboard.\r\nThen you can paste it anywhere in graphic editor,\r\ndocument or else..." = "Ảnh chụp được lấy sẽ được sao chép vào bộ nhớ tạm.\r\nSau đó bạn có thể dán nó bất cứ đâu trong đồ họa"
"Taken snapshot will be saved to your hard drive.\r\nYou will see a dialog to navigate to desired folder" = "Ảnh chụp được lấy sẽ được lưu vào ổ cứng của bạn\r\nBạn sẽ thấy một hộp thoại dẫn tới thư mục mong muốn"
"Takes a screenshot of currently played file/frame.\r\nBy default the snapshot is placed into clipboard" = "Lấy một ảnh chụp của tập tin/khung được chơi hiện thời.\r\nMặc định, ảnh chụp được đặt trong bộ nhớ tạm"
"Technical and information support center:\r\nfind out how we can help you, search for answers or contact Eltima easily." = "Trung tâm hỗ trợ thông tin và kĩ thuật:\r\ntìm ra cách chúng tôi có thể giúp bạn, tìm kiếm câu trả lời hoặc liên hệ Eltima dễ dàng"
"Text" = "Văn bản"
"Text color" = "Màu văn bản"
"Text options" = "Tùy chọn văn bản"
"Texts" = "Văn bản"
"There are no lines or colors to edit\r\nin selected shape or no shape was selected." = "Không có dòng hoặc màu để sửa\r\ntrong hình dạng được chọn hoặc không có hình dạng nào được chọn"
"This movie has only 1 frame, you can't rewind it" = "Phim này chỉ có 1 khung, bạn không thể tua lại nó"
"This tab is disabled because no files are added to My tasks list.\r\nPlease, drop some Flash movies there." = "Thẻ này bị vô hiệu bởi vì không có tập tin dduocj thêm vao Danh sach công việc của tôi.\r\nHãy kéo một số phim Flash vào đây"
"This task does not contain\r\nany dynamic texts.\r\n" = "Công việc này không chứa\r\nvăn bản động\r\n"
"Thumbnails for Buttons" = "Ảnh thu nhỏ cho Nút"
"Thumbnails for Fonts" = "Ảnh thu nhỏ cho Font"
"Thumbnails for Images" = "Ảnh thu nhỏ cho Ảnh"
"Thumbnails for Morphs" = "Ảnh thu nhỏ cho Morph"
"Thumbnails for Shapes" = "Ảnh thu nhỏ cho Hình Dạng"
"Thumbnails for Sprites" = "Ảnh thu nhỏ cho Sprite"
"Thumbnails for Texts" = "Ảnh thu nhỏ cho Văn Bản"
"Thumbnails for Videos" = "Ảnh thu nhỏ cho Video"
"To  be  able  to  correctly  decompile  Flash  components, we have to keep their database on your disc. In case you have additional components elsewhere, you can add SWC files manually. Otherwise, use the Update button to automatically fetch all Flash components available in your system." = "Để có thể biên dich ngược các thành phần Flash, chúng ta phải giữ cơ sở dữ liệu của chúng trên đĩa cứng của bạn. Trong trường hợp bạn có các thành phần thêm vào trong, bạn có thể thêm tập tin SWC bằng tay. Cách khác, dùng nút Cập nhật để tự động tìm nạp tất cả các thành phần sẵn có trên máy bạn."
"Total" = "Tổng cộng"
"Transparent" = "Trong suốt"
"Treat text as HTML" = "Xem văn bản như HTML"
"Unable to open file." = "Không thể mở tập tin"
"Unfortunately, Adobe Flash player ActiveX isn't installed in your system. Flash Decompiler requires this ActiveX control for proper working. Please, visit www.adobe.com and install Flash Player or contact Eltima technical support (support@eltima.com)." = "Thất bất tiện, Adobe Flash player ActiveX không được cài trên hệ thống của bạn. Flash Decompiler yêu cầu điều khiển ActiveX cho công việc đúnghãy ghé thăm www.adobe.com và caid đặt Flash Player hoặc liên hệ hỗ trợ kĩ thuật Eltima tại support@eltima.com"
"Unfortunately, you cannot save SWF files in demo version. This feature will be enabled once you register your copy of Flash Decompiler. Please, visit www.eltima.com for purchasing details." = "Thật bất tiện, bạn không thể lưu tập tin SWF trong phiên bản dùng thử Tiện ích này sẽ có khi bạn đăng kí bản sao của Flash Decompiler.Hãy ghé thăm www.eltima.com để biết chi tiết mua"
"Unlimited Business" = "Bản Thương Mại Không Giới Hạn"
"Updated" = "Đã cập nhật"
"Use Flash movie background color" = "Dùng màu nền phim Flash"
"Use getProperty/setProperty" = "Dùng getProperty/setProperty"
"Use system font" = "Dùng font hệ thống"
"Use tabs" = "Dùng thẻ"
"Used by" = "Dùng bởi"
"Uses" = "Dùng"
"Value" = "Giá trị"
"Var name" = "Tên biến"
"Version" = "Phiên bản"
"Version %@" = "Phiên bản %@"
"Video" = "Video"
"Videos" = "Các Video"
"View currently assigned hot keys for faster access\r\nto most frequent actions." = "Xem các phím tắt được gán hiện thời để truy cập nhanh\r\n đến các hành động phổ biến nhất"
"Visit Flash Decompiler homepage online." = "Thăm trang chủ Flash Decompiler trực tuyến"
"Whole words only" = "Chỉ toàn bộ từ"
"Width:" = "Độ rộng:"
"Yes" = "Vâng"
"You have Flash ActiveX version: %@" = "Bạn có ActiveX phiên bản: %@"
"You may alter ActionScripts syntax highlighting here. This will only influence their representation in Flash Decompiler." = "Bạn có thể sửa đổi cú pháp các ActionScript đang đánh dấu ở đây"
"You should restart Flash Decompiler to apply new language." = "Bạn nên khởi động lại Flash Decompiler để áp dụng ngôn ngữ mới"
"ZLib compressed:" = "ZLib được nén:"
"Zoom" = "Phóng đại"
"Zoom Slider" = "Phóng đại Slider"
"no" = "không"
"temp" = "tạm"
"yes" = "vâng"
" " = " "
"Action tag #%@" = "Thẻ hành động #%@"
"Add File(s)..." = "Thêm tập tin..."
"As button" = "Như nút"
"Ascent" = "Nâng lên"
"Bold" = "Đậm"
"Building scripts ..." = "Tạo các script ..."
"Built in" = "Tạo trong"
"Comment" = "Ghi chú"
"Components" = "Thành phần"
"Descent" = "Hạ xuống"
"Down" = "Xuống"
"Dyn text" = "Văn bản động"
"Edge bounds" = "Ranh giới lề"
"Element:" = "Yếu tố:"
"Encoding" = "Đang mã hóa"
"End bounds" = "Ranh giới cuối"
"Flash Components in database:" = "Thành phần Flash trong cơ sở dữ liệu:"
"Flash Components' database path:" = "Đường dẫn cơ sở dữ liệu các thành phần Flash:"
"Flash movie (*.SWF)|*.SWF|" = "Phim Flash (*.SWF)|*.SWF|"
"Font name" = "Tên Font"
"Foreground color:" = "Màu chữ:"
"Frames count" = "Đếm khung"
"Glyph count" = "Đếm nét chạm"
"Hit" = "Đánh"
"Italic" = "Nghiêng"
"JPEG" = "JPEG"
"Keyword" = "Từ khóa"
"Label" = "Nhãn"
"Language code" = "Mã ngôn ngữ"
"Literal" = "Chữ in"
"Matrix" = "Ma trận"
"Move(%@)" = "Chuyển(%@)"
"Operator" = "Hoạt động"
"Over" = "Quá"
"Recover register variables" = "Phục hồi các biến đăng kí"
"Scale(%@)" = "Căng(%@)"
"Rotate(%@)" = "Xoay(%@)"
"Select folder to store components database" = "Chọn thư mục để chứa cơ sở dữ liệu các thành phần"
"Small" = "Nhỏ"
"Start bounds" = "Giới hạn đầu"
"Stat text" = "Văn bản đầu"
"State" = "Trạng thái"
"String" = "Chuỗi"
"Track mode" = "Chế độ bài nhạc"
"Up" = "Lên"
"Update" = "Cập nhật"
"Use non-scalling strokes" = "Dùng các nét không vảy"
"Uses Defaults" = "Dùng Mặc Định"
"Whitespace" = "Khoảng trắng"
"alpha" = "an-pha"
"blue" = "xanh dương"
"green" = "xanh lục"
"red" = "đỏ"
"FirstSample: %@" = "Mẫu đầu: %@"
"LastSample: %@" = "Mẫu cuối: %@"
"Repeat: %@" = "Lạp lại: %@"
"No multiple" = "Không nhân"
"Stop" = "Ngừng"
"Stereo" = "Kênh đôi"
"Mono" = "Kênh đơn"
"As menu" = "Như trình đơn"
"VideoPacket" = "Đóng gói Video"
"Off" = "Tắt"
"On" = "Bật"
"Left" = "Trái"
"Center" = "Giữa"
"Justify" = "Canh đều"
"Flash Decompiler Trillix intro" = "Giới thiệu Flash Decompiler Trillix"
"Understanding demo limitations" = "Thông cảm các giới hạn bản Demo"
"&About Flash Decompiler..." = "&Về Flash Decompiler..."
"Applying" = "Đang áp dụng"
"Codec" = "Bộ giải mã"
"Extracting %s..." = "Đang giải nén %s..."
"Extracting ..." = "Đang giải nén ..."
"Extracting resources from %s..." = "Đang giải nén nguồn từ %s..."
"Extraction done." = "Giải nén xong."
"Extraction started ..." = "Giải nén đã chạy..."
"Rate" = "Tỉ lệ"
"Sample bits" = "Bit mẫu"
"Samples count" = "Đếm mẫu"
"Stereo/mono" = "Kênh đôi/kênh đơn"
"Streaming sound" = "Dòng âm thanh"
"You can click this button as well! It has some valuable stuff inside" = "Bạn có thể kích nút này được! Nó có một số giá trị ẩn bên trong"
"Continue demo" = "Tiếp tục dùng thử"
"Enter registration code" = "Nhập mã đăng kí"
"Order now" = "Mua ngay"
"Thank you very much for trying the Demo version of Flash Decompiler Trillix by Eltima Software.\r\n\r\nThe demo version is fully-functional, but implies certain demo limitations. Among them:\r\n\r\n - only two objects will be exported in every resource category;\r\n - Flash movies will be converted into FLA in black-and-white;\r\n - ActionScripts will not be included in resulting FLA files;\r\n - decompiled ActionScripts cannot be copied to clipboard;\r\n - you won't be able to save changes to your Flash files after editing.\r\n\r\nPlease, don't forget to register your copy of the software to get rid of all demo limitations forever.\r\nTo get your registration key, please, click 'Order now' below." = "Cảm ơn bạn rất nhiều vì đã dùng thử phiên bản Demo của Flash Decompiler Trillix của Eltima Software\r\nPhiên bản demo có đầy đủ chức năng, nhưng tất nhiên có một số giới hạn demo. Trong số chúng\r\n - chỉ có 2 đối tượng được xuất trong mỗi danh mục nguồn\r\n - các phim Flash sẽ được chuyển đổi sang FLA dạng đen-trắng\r\n - các ActionScript sẽ không được bao gồm trong các tập tin FLA kết quả\r\n - các ActionScript được biên soạn ngược không thể sao chép được vào bộ nhớ tạm\r\n - bạn sẽ không thể lưu các thay đổi vào tập tin Flash của bạn sau khi sửa\r\nHãy đừng quên đăng kí bản sao phần mềm của bạn đê loại bỏ tất cả các giới hạn mãi mãi\r\nĐể lấy khóa đăng kí của bạn, hãy kích nút 'Mua ngay' bên dưới."
"Register" = "Đăng kí"
"Eltima - Waiver of responsibility" = "Eltima - Giấy từ bỏ trách nhiệm"
"Register Flash Decompiler now" = "Đăng kí Flash Decompiler bây giờ"
"To apply localization, you need to restart Flash Decompiler Trillix. Press Yes to close Flash Decompiler now, and restart it manually; or No to do it later. If you press Cancel, localization changes will not be applied." = "Để áp dụng ngôn ngữ, bạn cần khởi động lại Flash Decompiler. Nhấn Vâng để đóng Flash Decompiler ngay\r\n và khởi động lại nó bằng tay; hoặc Không để làm nó sau. Nếu bạn nhấn Hủy bỏ, các thay đổi ngôn ngữ sẽ không được áp dụng"
"Flash Decompiler Trillix is not registered on this machine. If you want to use it you need to register it now." = "Flash Decompiler Trillix chưa được đăng kí trên máy này. Nếu bạn muốn dùng nó bạn cần phải đang kí bây giờ."
"Flash Decompiler Trillix is already registered in this system. Please, don't enter another registration details unless you want to change your registration name or license type." = "Flash Decompiler Trillix đã được đăng kí trên hệ thống này. Vui lòng đừng nhập chi tiết đăng kí khác nếu bạn không muốn thay đổi tên đang kí hoặc loại giấy phép."
"Adding file(s) to the tasks list..." = "Thêm tập tin vào danh sách công việc..."
"Preview" = "Xem trước"
"Open" = "Mở"
"Quick actions" = "Hành động nhanh"
"Convert SWF to FLA" = "Chuyển đổi SWF sang FLA"
"Show/Hide" = "Hiện/Ẩn"
"Customize the way Flash Decompiler looks like, it may also help you recover the lost panel." = "Tùy chỉnh Flash Decompiler thoe cách bạn muốn, nó cũng có thể giúp bạn phục hồi bảng bị mất"
"Removing task(s)..." = "Đang loại bỏ công việc..."
"Quick extract all currently selected SWF resources." = "Giải nén nhanh tất cả nguồn SWF đã chọn hiện thời"
"Quick convert currently highlighted file from the tasks list." = "Chuyển đổi nhanh các tập tin được đánh dấu hiện thời từ danh sách công việc"
"The following checkbox enables Flash Decompiler to save your tasks statuses after exiting and relaunching. By default, Flash Decompiler will save all previous tasks as they were before you exit." = "Ô chọn sau cho phép Flash Decompiler lưu các trạng thái công việc của bạn sau khi thoát và chạy lại. Mặc định, Flash Decompiler sẽ lưu tất cả công việc trước đó trước khi bạn thoát."
"Save My tasks list status on exit" = "Lưu trạng thái danh sách Công việc của tôi lúc thoát"
"These buttons let you reset visibility and positions of the main three panels: My tasks, File properties and Tag info. This is quite convenient when you \"lose\" them by dragging out or configuring the GUI." = "Các nút này để bạn đặt lại sự xuất hiện và vị trí của 3 bảng chính: Công việc của tôi, Thuộc tính tập tin và Thẻ thông tin. Điều này khá thuận tiện khi bạn \"đánh mất\" chúng bằng cách kéo ra hoặc cấu hình GUI"
"Reset \"My tasks\" panel position" = "Đặt lại Vị trí bảng Công việc của tôi"
"Reset \"File properties\" panel position" = "Đặt lại Vị trí bảng Thuộc tính tập tin"
"Reset \"Tag information\" panel position" = "Đặt lại Vị trí bảng Thẻ thông tin"
"General Flash Decompiler settings" = "Thiết đặt chung Flash Decompiler"
"Open Flash movies" = "Mở các phim Flash"
"Name:" = "Tên"
"Code:" = "Mã"
"Converting ..." = "Đang chuyển đổi..."
"Warning: you don't have Adobe Flash installed in this system at all. You won't be able to edit FLA file in this system." = "Cảnh báo: bạn chưa cài đặt Adobe Flash trên hệ thống này. Bạn sẽ không thể sửa tập tin FLA trên hệ thống này."
"Loading file \"%s\"..." = "Đang nạp tập tin \"%s\"...";
"Cannot load file. File is either locked by another process or corrupt." = "Không thể nạp tập tin. Tập tin bị khóa bởi tiến trình khác hoặc bị hỏng";
"Saving file \"%s\"..." = "Đang lưu tập tin \"%s\"...";
"Saving has been cancelled." = "Lưu được hủy bỏ";
"Starting header processing..." = "Bắt đầu xử lí đầu hàng...";
"Header processing finished." = "Xử lí đầu hàng xong";
"Starting timeline processing..." = "Bắt đàu xử lí hàng chờ...";
"Timeline processing finished." = "Xử lí hàng chờ xong";
"An error has occured while parsing SWF timeline." = "Một lỗi đã xảy ra trong khi chia sẻ dòng chờ SWF";
"An error has ocurred while processing timeline." = "Một lỗi đã xảy ra trong khi xử lí dòng chờ";
"An error has ocurred while creating FLA timeline." = "FLA Một lỗi đã xảy ra trong khi tạo dòng chờ FLA";
"Processing sprite symbol #%d..." = "Đang xử lí các biểu tượng sprite #%d...";
"Processing button symbol #%d..." = "Đang xử lí biểu tượng nút #%d...";
"Button symbol #%d processing finished." = "Xử lí biểu tượng nút #%d đã hoàn thành";
"Starting library processing..." = "Bắt đầu xử lí thư viện...";
"An error has ocurred while processing library." = "Một lỗi đã xảy ra trong khi xử lí thư viện";
"Library processing finished." = "Xử lí thư viện đã hoàn thành";
"Cannot create destination file or it is occupied by another application. Please choose another name for FLA file." = "Không thể tạo tập tin đích hoặc nó đang được sử dụng bởi một ứng dụng khác. Hãy chọn một tên khác cho tập tin FLA";
"Used fill style is not fully supported by convertor or by FLA file format." = "Kiểu điền đầy được sử dụng không được hỗ trợ đầy đủ bởi trình chuyển đổi hoặc bởi định dạng tập tin FLA";
"Font #%d not found" = "Font #%d không tìm thấy";
"An error has occurred while normalizing tags in SWF file." = "Một lỗi đã xảy ra khi chuẩn hóa các thẻ trong tập tin SWF";
"Cannot create \"%s\" file." = "Không thể tạo tập tin \"%s\"";
"Cannot create \"%s\" directory." = "Không thể tạo thư mục \"%s\"";
"An error has occured while saving FLP or AS file(s)." = "Một lỗi đã xảy ra khi lưu tập tin FLP hoặc AS";
"Different caps styles for begin/end of the same line are not supported in FLA format. They must match each other." = "Các kiểu chữ hoa khác cho bắt đầu/kết thúc của các dòng giống nhau không được hỗ trợ trong định dạng FLA";
"Starting conversion..." = "Bắt đầu chuyển đổi...";
"File conversion finished." = "Chuyển đổi tập tin đã hoàn thành";
"You are trying to save the file in Macromedia Flash %d format. \nIn order to work it correctly, this file must be saved in Macromedia Flash %d. \nPlease, select \"Yes\" to convert to version %d or \"No\" to continue conversion into the old format. \nNote that some features could be lost in this case." = "Bạn đang thử lưu tập tin trong định dạng Macromedia Flash %d. \nĐể nó làm việc chính xác, tập tin này phải được lưu trong Macromedia Flash %d. \nVui lòng, chọn \"Vâng\" để chuyển đổi sang phiên bản %d hoặc \"Không\" để tiếp tục chuyển đổi trong đinh dạng cũ. \nChú ý rằng một số tiện ích có thể bị mất trong trường hợ này."
"Warning: you are trying to convert this movie into FLA format of version %d, however, you only have Adobe Flash of version %d installed. Most probably, you won't be able to open converted FLA file until you upgrade your version of Flash." = "Cảnh báo: bạn đang thử chuyển đổi phim này sang định dạng FLA của phiên bản %d, tuy nhiên, bạn chỉ có Adobe Flash của phiên bản %d được cài. Phần lớn chắc chắn bạn không thể mở tập tin FLA đã chuyển đén khi bạn nâng cấp phiên bản Flash của bạn."
"Warning: the movie which you are trying to convert requires features of Adobe Flash %d, however, you only have Adobe Flash version %d installed. Most probably, you won't be able to open converted FLA file until you upgrade your version of Flash. Do you still wish to continue converting into upper version of FLA? (If you select NO, this movie will be converted into FLA format of version %d, some objects may be lost)" = "Cảnh báo: phim mà bạn đang thử chuyển đổi yêu cầu các tiện ích của Adobe Flash %d, tuy nhiên, bạn chỉ có Adobe Flash phiên bản %d được cài. Phần lớn chắc chắn, bạn sẽ không thể mởtập tin FLA đã chuyển đén khi bạn nâng cấp phiên bản Flash của bạn. Bạn vẫn muốn tiếp tục chuyển đổi sang phiên bản cao hơn của FLA? (Nếu bạn chọn KHÔNG, phim này sẽ được chuyển đổi sang định dạng FLA của phiên bản %d, một số đối tượng có thể bị mất)"
"Thank you for registration!" = "Cảm ơn bạn đã đăng kí!"
"About L.A.M.E and FFmpeg" = "Về L.A.M.E và FFmpeg";
"Show information about third-party libraries used and their licensing details" = "Hiện thông tin về các thư viện của hãng thứ ba được sử dụng và chi tiết giấy phép của chúng";
"Flash Decompiler uses L.A.M.E and FFmpeg (both under LGPL v.3)" = "Flash Decompiler dùng L.A.M.E và FFmpeg (cả hai dưới quyền LGPL v.3)";
"About third-party libraries" = "Về các thư viện của hãng thứ ba";
"Don't show this message again" = "Không hiện thông náo này nữa";
"File (or files) you are trying to convert was created by Adobe Flex Builder and therefore cannot be converted into FLA. Instead, a Flex Builder project will be created. You will need Adobe Flex Builder software to edit this project." = "Tập tin (hoặc các tập tin) mà bạn đang cố gắng chuyển đổi được tạo bởi Adobe Flex Builder và do đó không thể chuyển sang FLA. Thay vào đó, một dự án Flex Builder sẽ được tạo. Bạn sẽ cần phần mềm Adobe Flex Builder để sửa dự án này.";
"Register your copy of Flash Decompiler now by obtaining a license online." = "Đăng kí bản sao Flash Decompiler của bạn ngay bây giờ bằng việc mua một giấy phép trực tuyến.";
"Conversion started..." = "Chuyển đổi đã bắt đầu...";
"Error parsing SWF file, please, send it to support@eltima.com" = "Lỗi phân tích tập tin SWF, vui lòng gởi nó tới support@eltima.com";
"Options" = "Tùy chọn";
"Make text bold" = "Tạo văn bản đậm";
"Failed to convert ActionScript into MXML" = "Lỗi chuyển đổi ActionScript sang MXML";
"Failed to save resources" = "Lỗi lưu nguồn";
"Use system font instead of embedded one" = "Dùng Font hệ thống thay vì font được nhúng";
"InitClip" = "InitClip";
"Change font" = "Thay đổi Font";
"Unknown error" = "Lỗi không biết";
"Interface" = "Giao diện"
"Please, be informed that Eltima provides Flash/SWF decompilation \r\ntechnology with Flash Decompiler Trillix for personal use only, \r\nnot for copyrighted materials you are not the owner of. \r\nYou hereby confirm that you are aware of all possible copyright \r\ninfringements when decompiling Flash/SWF files and realize \r\nthat Eltima waives any responsibility thereafter." = "hãy hiểu cho rằng Eltima cung cấp kĩ thuật biên dịch ngược Flash/SWF với Flash Decompiler Trillix chỉ cho việc sử dụng cá nhân, \r\nkhông cho các tài liệu bản quyền mà bạn không sở hữu. \r\nBằng cách này bạn xác nhận rằng bạn nhận thức tất cả sự xâm phạm bản quyền có thể\r\nkhi biên dịch ngược các tập tin Flash/SWF và nhận ra rằng\r\nEltima từ bỏ mọi trách nhiệm sau này."
"Unable to convert ActionScript class: %@ into MXML, please, send this file to support@eltima.com" = "Không thể chuyển đổi lớp ActionScript: %@ sang MXML, hãy gởi tập tin này tới support@eltima.com";
"Component database is empty. Do you want to search for installed Flash Components?" = "Thành phần cơ sở dữ liệu trống. Bạn có muốn tìm kiếm các thành phần Flash đã cài không?";
"Warning: static texts cannot be edited without changing their font. Please, select the new font first then you will be able to edit static text." = "Cảnh báo: các văn bản tĩnh không thể được sửa mà không thay đổi font của chúng. Hãy chọn font mới trước, sau đó bạn sẽ có thể sửa văn bản tĩnh.";
"This task does not contain\r\nany texts.\r\n" = "Công việc này không chứa văn bản.\r\n";
"Flash Player 9" = "Flash Player 9"
"This file turns out not to be a Flex file, please, send it to support@eltima.com for investigation." = "Tập tin này tạo ra không phải là một tập tin Flex, hãy gởi nó tới support@eltima.com để nghiêng cứu.";
"Could not save Flex Project file(s), check your user rights." = "Không thể lưu tập tin Dự án Flex, hãy kiểm tra các quyền người dùng của bạn.";
"Failed to save AS files" = "Lỗi luu các tập tin AS";
"This folder doesn't have any supported files to preview or open" = "Thư mục này không có các tập tin được hỗ trợ để xem trước hoặc mở";
"Unknown error! Please, send the file you are trying to convert to support@eltima.com" = "Lỗi không biết! hãy gởi tập tin mà bạn đang cố gắng chuyển đổi tới support@eltima.com";
"FLA version: " = "Phiên bản FLA: ";
"ActionScripts viewing && conversion settings." = "Các thiết đặt chuyển đổi && xem các ActionScript.";
"Italicize text" = "Văn bản nghiêng";
"Could not save AS file(s), check your user rights." = "Không thể lưu (các) tập tin AS, hãy kiểm tra các quyền người dùng của bạn.";
"Edit texts" = "Sửa văn bản";
"Demo version does not convert Flex projects, you can only preview ActionScripts stored in Flex files. To convert Flex files to their source code, please, obtain a license of Flash Decompiler Trillix.\r\rIf you are not sure in conversion results, send your Flex file to support@eltima.com for revision." = "Phiên bản Demo không chuyển đổi các dự án Flex, bạn chỉ có thể xem trước các ActionScript được chứa trong các tập tin Flex. Để chuyển đổi các tập tin Flex sang mã nguồn của chúng, hãy mua một giấy phép của Flash Decompiler Trillix.\r\rNếu bạn không chắc trong các kết quả chuyển đổi, hãy gửi tập tin Flex của bạn tới support@eltima.com để xem xét.";
"Done" = "Xong"
"File operation failed" = "Thao tác tập tin bị lỗi";
"Use scalling strokes" = "Dùng nét vảy"
"Flash Decompiler uses L.A.M.E. and FFmpeg (both under LGPL v.3)" = "Flash Decompiler dùng L.A.M.E. và FFmpeg (cả hai theo các điều khoản của LGPL v.3)";
"Failed to save project files" = "Lỗi lưu các tập tin dự án";
"Error" = "Lỗi";
"Uses L.A.M.E. and FFmpeg under LGPL v.3" = "Dùng L.A.M.E. và FFmpeg theo các điều khoản của LGPL v.3";
"Converting %s file into Flex project..." = "Đang chuyển đổi tập tin %s sang dự án Flex...";
"Deblocking mode" = "Chế độ rã khối"
"Smoothing on" = "Làm nhẵn"
"Could not open file: %@ for writing." = "Không thể tạo tập tin: %@ để ghi.";
"Do you want to continue?" = "Bạn có muốn tiếp tục không?";
"Unable to create folder: %@, check your user rights." = "Không thể tạo thư mục: %@, hãy kiểm tra các quyền người dùng của bạn.";
"Failed to parse SWF file" = "Lỗi phân tích tập tin SWF";
"Sprite symbol #%d processing finished." = "Biểu tượng Sprite #%d xử lí đã xong."
"Change font size" = "Thay đổi kích thước Font";
"Online tutorials" = "Hướng dẫn trực tuyến";
"SWF file doesn't have Flex ActionScript" = "Tập tin SWF không có Flex ActionScript";
"Flash Decompiler" = "Flash Decompiler";
"Failed to open file " = "Lỗi mở tập tin ";
"Could not save Flex Project resources, check your user rights." = "Không thể lưu nguồn Dự án Flex, kiểm tra các quyền người dùng của bạn.";
"All sound files (*.WAV, *.MP3)|*.WAV;*.MP3|Wave sounds (*.WAV)|*.WAV|MP3 music (*.MP3)|*.MP3|" = "All sound files (*.WAV, *.MP3)|*.WAV;*.MP3|Wave sounds (*.WAV)|*.WAV|MP3 music (*.MP3)|*.MP3|"
"SWF to FLA conversion" = "SWF to FLA conversion"
"Recover arguments' names" = "Recover arguments' names"
"SWF object extraction" = "SWF object extraction"
"Editing SWF file" = "Editing SWF file"

"Extract all currently selected SWF resources." = "Extract all currently selected SWF resources.";
